exercise-actors-part3/app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("title", "description", "beds", "guests", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @room = Room.new(room_params)
    if @room.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @room = Room.find(params[:id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rooms" SET "title" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["title", "Un titulo mejor"], ["updated_at", "2023-03-01 21:01:13.038959"], ["id", 1]]
---
  def update
    @room = Room.find(params[:id])
    @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]
---
  def destroy
    Room.destroy(params[:id])